/**
 * Создайте функцию readNumber, которая будет запрашивать ввод числового значения до тех пор, пока посетитель его не введёт.
 * Функция должна возвращать числовое значение.
 * Также надо разрешить пользователю остановить процесс ввода, отправив пустую строку или нажав «Отмена». В этом случае функция должна вернуть null.
 */
function readNumber() {
	let num;
	// Если введено что угодно, кроме Отмены, то цикл продолжается
	while (num !== null && num !== '') {
		num = prompt("Введите число", 0);
		if (Number(num)) {
			return Number(num);
		}
	}
	return null;
}
alert(readNumber());